onec-mid-base-11/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>KRV_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.KRV_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>KRV_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.KRV_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>KRV_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.KRV_КонтактныеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/Documents/ОплатаОтПокупателя/ОплатаОтПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаОтПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>KRV_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.KRV_КонтактныеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

onec-mid-base-11/src/Documents/ОплатаПоставщику/ОплатаПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаПоставщику</name>
  <registerRecords>AccumulationRegister.ЗадолженностьПоставщикам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>KRV_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.KRV_КонтактныеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/KRV_РаботаСФормами/Module.bsl
#Область ПрограммныйИнтерфейс

//Определяет имя формы и вызывает соответвующую процедуру для добавления полей на форму
//  Параметры:
//   Форма - ФормаКлиентскогоПриложения
//
Процедура ДобавлениеРеквизитовНаФорму(Форма) Экспорт;
//НачалоДоработки
//Королёв Р.В.14.05.2024 
//Определяет имя формы и вызывает соответвующую процедуру для добавления полей на форму

	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда  
		
		ДобавитьПолеВГруппуШапкаПраво(Форма);

	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		
		ДобавитьПолеВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда  
		
		ДобавитьПолеВГруппуШапкаПраво(Форма); 
			
    ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		
		ДобавитьПолеНаФормуПередОснование(Форма); 
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда 
		
		ДобавитьПолеНаФормуПередСумма(Форма);
		
	КонецЕсли;

//КонецДоработки	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПолеВГруппуШапкаПраво(Форма)
//НачалоДоработки
//Королёв Р.В.14.05.2024 
//Добавляет на форму поле "Контактное лицо"

	 ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.KRV_КонтактноеЛицо";
//КонецДоработки	 
КонецПроцедуры 

Процедура ДобавитьПолеНаФормуПередСумма(Форма) 
//НачалоДоработки
//Королёв Р.В.14.05.2024 
//Добавляет на форму поле "Контактное лицо"	 

	 ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.KRV_КонтактноеЛицо";
	 
//КонецДоработки	
КонецПроцедуры

 
Процедура ДобавитьПолеНаФормуПередОснование(Форма) 
//НачалоДоработки
//Королёв Р.В.14.05.2024 
//Добавляет на форму поле "Контактное лицо"

	 ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.Основание);
	 ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	 ПолеВвода.ПутьКДанным = "Объект.KRV_КонтактноеЛицо";
	 
//КонецДоработки	  
КонецПроцедуры

#КонецОбласти
